In [21]:
import pandas as pd
from google.colab import files

In [4]:
uploaded = files.upload()

Saving student_result .csv to student_result .csv

In [5]:
df = pd.read_csv('student_result .csv')
df

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1001       10            2          6          50
1        1002       10            5          7          80
2        1003       10            6          5          70
3        1004       11            7          6          60
4        1005       11            8          7          45

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.columns

Index(['Student Id', '\tclass', '\tstudy hrs', '\tslp hrs', 'social mda'], dtype='object')

In [8]:
df2 = pd.read_csv('student_result .csv',nrows=3)
df2

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1001       10            2          6          50
1        1002       10            5          7          80
2        1003       10            6          5          70

In [9]:
df2 = pd.read_csv('student_result .csv',nrows=1)
df2

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1001       10            2          6          50

In [11]:
df2 = pd.read_csv('student_result .csv',usecols=[1,2,0])
df2

   Student Id  \tclass  \tstudy hrs
0        1001       10            2
1        1002       10            5
2        1003       10            6
3        1004       11            7
4        1005       11            8

In [12]:
df2 = pd.read_csv('student_result .csv',usecols=[1,2])
df2

   \tclass  \tstudy hrs
0       10            2
1       10            5
2       10            6
3       11            7
4       11            8

In [15]:
df2 = pd.read_csv('student_result .csv',usecols=[1,2,0])
df2

   Student Id  \tclass  \tstudy hrs
0        1001       10            2
1        1002       10            5
2        1003       10            6
3        1004       11            7
4        1005       11            8

In [16]:
df2 = pd.read_csv('student_result .csv',skiprows=1)
df2

   1001  \t10  \t2  \t6  \t50
0  1002    10    5    7    80
1  1003    10    6    5    70
2  1004    11    7    6    60
3  1005    11    8    7    45

In [17]:
df2 = pd.read_csv('student_result .csv',skiprows=[0])
df2

   1001  \t10  \t2  \t6  \t50
0  1002    10    5    7    80
1  1003    10    6    5    70
2  1004    11    7    6    60
3  1005    11    8    7    45

In [18]:
df2 = pd.read_csv('student_result .csv',skiprows=[1,4])
df2

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1002       10            5          7          80
1        1003       10            6          5          70
2        1005       11            8          7          45

#use colum as index

In [19]:
df2 = pd.read_csv('student_result .csv',index_col='Student Id')
df2

            \tclass  \tstudy hrs  \tslp hrs  social mda
Student Id
1001             10            2          6          50
1002             10            5          7          80
1003             10            6          5          70
1004             11            7          6          60
1005             11            8          7          45

In [20]:
df2 = pd.read_csv('student_result .csv',index_col=2)
df2

             Student Id  \tclass  \tslp hrs  social mda
\tstudy hrs
2                  1001       10          6          50
5                  1002       10          7          80
6                  1003       10          5          70
7                  1004       11          6          60
8                  1005       11          7          45

In [23]:
df2 = pd.read_csv('student_result .csv',header=1)
df2

   1001  \t10  \t2  \t6  \t50
0  1002    10    5    7    80
1  1003    10    6    5    70
2  1004    11    7    6    60
3  1005    11    8    7    45

In [24]:
df2 = pd.read_csv('student_result .csv',header=None)
df2

            0        1            2          3           4
0  Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
1        1001     \t10          \t2        \t6        \t50
2        1002     \t10          \t5        \t7        \t80
3        1003     \t10          \t6        \t5        \t70
4        1004     \t11          \t7        \t6        \t60
5        1005     \t11          \t8        \t7        \t45

In [25]:
df2 = pd.read_csv('student_result .csv',header=None,prefix='Columns')
df2

     Columns0 Columns1     Columns2   Columns3    Columns4
0  Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
1        1001     \t10          \t2        \t6        \t50
2        1002     \t10          \t5        \t7        \t80
3        1003     \t10          \t6        \t5        \t70
4        1004     \t11          \t7        \t6        \t60
5        1005     \t11          \t8        \t7        \t45

In [26]:
df2 = pd.read_csv('student_result .csv',header=None,prefix='Col')
df2

         Col0     Col1         Col2       Col3        Col4
0  Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
1        1001     \t10          \t2        \t6        \t50
2        1002     \t10          \t5        \t7        \t80
3        1003     \t10          \t6        \t5        \t70
4        1004     \t11          \t7        \t6        \t60
5        1005     \t11          \t8        \t7        \t45

In [27]:
df2 = pd.read_csv('student_result .csv',names=['a','b','c','d','e'])
df2

            a        b            c          d           e
0  Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
1        1001     \t10          \t2        \t6        \t50
2        1002     \t10          \t5        \t7        \t80
3        1003     \t10          \t6        \t5        \t70
4        1004     \t11          \t7        \t6        \t60
5        1005     \t11          \t8        \t7        \t45

In [28]:
df2 = pd.read_csv('student_result .csv')
df2.head()

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1001       10            2          6          50
1        1002       10            5          7          80
2        1003       10            6          5          70
3        1004       11            7          6          60
4        1005       11            8          7          45

In [29]:
df2 = pd.read_csv('student_result .csv')
df2.head(2)

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1001       10            2          6          50
1        1002       10            5          7          80

In [30]:
df2 = pd.read_csv('student_result .csv')
df2.tail()

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0        1001       10            2          6          50
1        1002       10            5          7          80
2        1003       10            6          5          70
3        1004       11            7          6          60
4        1005       11            8          7          45

In [31]:
df2 = pd.read_csv('student_result .csv')
df2.tail(3)

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
2        1003       10            6          5          70
3        1004       11            7          6          60
4        1005       11            8          7          45

In [32]:
df2 = pd.read_csv('student_result .csv',dtype={'Student Id':'float64'})
df2.tail()

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda
0      1001.0       10            2          6          50
1      1002.0       10            5          7          80
2      1003.0       10            6          5          70
3      1004.0       11            7          6          60
4      1005.0       11            8          7          45

In [39]:
uploaded = files.upload()

Saving student_result .csv to student_result  (2).csv

In [40]:
df = pd.read_csv('student_result  (2).csv')
df

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001       10            2          6          50   Yes
1        1002       10            5          7          80    No
2        1003       10            6          5          70   Yes
3        1004       11            7          6          60    No
4        1005       11            8          7          45   Yes

In [42]:
df = pd.read_csv('student_result  (1).csv',true_values=['Yes'],false_values=['No'])
df

   Student Id  \tclass  \tstudy hrs  \tslp hrs  social mda  tf_v
0        1001       10            2          6          50   yes
1        1002       10            5          7          80    no
2        1003       10            6          5          70   yes
3        1004       11            7          6          60    no
4        1005       11            8          7          45   yes